Revit 2027 API
LightType.ColorFilter Property
 The light filter color.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color ColorFilter { get; set; }
Public Property ColorFilter As Color
	Get
	Set
public:
property Color^ ColorFilter {
	Color^ get ();
	void set (Color^ value);
}
member ColorFilter : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
LightType Class
Autodesk.Revit.DB.Lighting Namespace